* Ссылки [[~/org/sbcl/sbcl-referencies.org][Ссылки]]
* Генерирование документации
#+name: graphs
#+BEGIN_SRC lisp
  (defun make-document ()
    (loop
      :for i :in
      '((:mnas-spring     :mnas-spring)
        (:mnas-spring/db  :mnas-spring/db)
        (:mnas-spring/gtk :mnas-spring/gtk)
        )
      :do (apply #'mnas-package:document i)))

  (defun make-graphs ()
    (loop
      :for i :in
      '(:mnas-spring
        :mnas-spring/db
        :mnas-spring/gtk
        )
      :do (mnas-package:make-codex-graphs i i)))

  (defun make-all ()
        (make-document)
        (make-graphs)
        (codex:document :mnas-spring)
        (make-graphs))

      (make-all)
#+END_SRC

#+RESULTS: graphs
: NIL

* Публикация
#+name: publish
#+BEGIN_SRC shell :var graphs=graphs
    mkdir -p "$HOME/public_html/Common-Lisp-Programs/"
    CDIR=`dirname $PWD | xargs basename`
    rsync -Pazh --delete ../docs/build/$CDIR/html/ $HOME/public_html/Common-Lisp-Programs/$CDIR 
    if [[ `hostname` == "mnasoft-00" ]]
    then
	echo "mnasoft-00"
  #     sh ~/bin/pi-html
    fi
    if [[ `hostname` == "N118383" ]]
    then
	echo "N118383"
        CPL="//n133619/home/_namatv/public_html/Site/Development/Common-Lisp-Programs"
	mkdir -p $CPL/$CDIR
	rsync -Pazh --delete ../docs/build/$CDIR/html/ $CPL/$CDIR
     fi
#+END_SRC

#+RESULTS: publish
| sending                             | incremental | file | list       |         |   |         |      |            |         |          |               |      |            |         |          |               |
| ./                                  |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
| 0-обзор.html                        |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.73K       | 100% | 0.00kB/s   | 0:00:00 |   | 2.73K   | 100% | 0.00kB/s   | 0:00:00 | (xfr#1,  | to-chk=36/38) |      |            |         |          |               |
| 1-обзор.html                        |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.78K       | 100% | 181.05kB/s | 0:00:00 |   | 2.78K   | 100% | 181.05kB/s | 0:00:00 | (xfr#2,  | to-chk=35/38) |      |            |         |          |               |
| call-graph-mnas-spring-db.gv        |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 44          | 100% | 2.86kB/s   | 0:00:00 |   | 44      | 100% | 2.86kB/s   | 0:00:00 | (xfr#3,  | to-chk=34/38) |      |            |         |          |               |
| call-graph-mnas-spring-db.gv.png    |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 116         | 100% | 7.55kB/s   | 0:00:00 |   | 116     | 100% | 7.55kB/s   | 0:00:00 | (xfr#4,  | to-chk=33/38) |      |            |         |          |               |
| call-graph-mnas-spring-gtk.gv       |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 263         | 100% | 17.12kB/s  | 0:00:00 |   | 263     | 100% | 17.12kB/s  | 0:00:00 | (xfr#5,  | to-chk=32/38) |      |            |         |          |               |
| call-graph-mnas-spring-gtk.gv.png   |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 32.49K      | 100% | 2.07MB/s   | 0:00:00 |   | 32.49K  | 100% | 2.07MB/s   | 0:00:00 | (xfr#6,  | to-chk=31/38) |      |            |         |          |               |
| call-graph-mnas-spring.gv           |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 91          | 100% | 5.92kB/s   | 0:00:00 |   | 91      | 100% | 5.92kB/s   | 0:00:00 | (xfr#7,  | to-chk=30/38) |      |            |         |          |               |
| call-graph-mnas-spring.gv.png       |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 7.19K       | 100% | 468.36kB/s | 0:00:00 |   | 7.19K   | 100% | 468.36kB/s | 0:00:00 | (xfr#8,  | to-chk=29/38) |      |            |         |          |               |
| class-graph-mnas-spring-db.gv       |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 44          | 100% | 2.86kB/s   | 0:00:00 |   | 44      | 100% | 2.86kB/s   | 0:00:00 | (xfr#9,  | to-chk=28/38) |      |            |         |          |               |
| class-graph-mnas-spring-db.gv.png   |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 116         | 100% | 7.55kB/s   | 0:00:00 |   | 116     | 100% | 7.55kB/s   | 0:00:00 | (xfr#10, | to-chk=27/38) |      |            |         |          |               |
| class-graph-mnas-spring-gtk.gv      |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 59          | 100% | 3.84kB/s   | 0:00:00 |   | 59      | 100% | 3.84kB/s   | 0:00:00 | (xfr#11, | to-chk=26/38) |      |            |         |          |               |
| class-graph-mnas-spring-gtk.gv.png  |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 4.32K       | 100% | 281.05kB/s | 0:00:00 |   | 4.32K   | 100% | 281.05kB/s | 0:00:00 | (xfr#12, | to-chk=25/38) |      |            |         |          |               |
| class-graph-mnas-spring.gv          |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 186         | 100% | 12.11kB/s  | 0:00:00 |   | 186     | 100% | 12.11kB/s  | 0:00:00 | (xfr#13, | to-chk=24/38) |      |            |         |          |               |
| class-graph-mnas-spring.gv.png      |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 22.03K      | 100% | 1.40MB/s   | 0:00:00 |   | 22.03K  | 100% | 1.40MB/s   | 0:00:00 | (xfr#14, | to-chk=23/38) |      |            |         |          |               |
| mnas-spring-db.html                 |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.61K       | 100% | 169.92kB/s | 0:00:00 |   | 2.61K   | 100% | 169.92kB/s | 0:00:00 | (xfr#15, | to-chk=22/38) |      |            |         |          |               |
| mnas-spring-gtk.html                |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 3.08K       | 100% | 200.59kB/s | 0:00:00 |   | 3.08K   | 100% | 200.59kB/s | 0:00:00 | (xfr#16, | to-chk=21/38) |      |            |         |          |               |
| mnas-spring.html                    |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 32.77K      |  80% | 2.08MB/s   | 0:00:00 |   | 40.95K  | 100% | 1.26MB/s   | 0:00:00 | (xfr#17, | to-chk=20/38) |      |            |         |          |               |
| symbol-graph-mnas-spring-db.gv      |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 121         | 100% | 3.81kB/s   | 0:00:00 |   | 121     | 100% | 3.81kB/s   | 0:00:00 | (xfr#18, | to-chk=19/38) |      |            |         |          |               |
| symbol-graph-mnas-spring-db.gv.png  |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 25.41K      | 100% | 800.56kB/s | 0:00:00 |   | 25.41K  | 100% | 800.56kB/s | 0:00:00 | (xfr#19, | to-chk=18/38) |      |            |         |          |               |
| symbol-graph-mnas-spring-gtk.gv     |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 215         | 100% | 6.77kB/s   | 0:00:00 |   | 215     | 100% | 6.77kB/s   | 0:00:00 | (xfr#20, | to-chk=17/38) |      |            |         |          |               |
| symbol-graph-mnas-spring-gtk.gv.png |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 23.89K      | 100% | 752.58kB/s | 0:00:00 |   | 23.89K  | 100% | 752.58kB/s | 0:00:00 | (xfr#21, | to-chk=16/38) |      |            |         |          |               |
| symbol-graph-mnas-spring.gv         |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 89          | 100% | 2.80kB/s   | 0:00:00 |   | 89      | 100% | 2.80kB/s   | 0:00:00 | (xfr#22, | to-chk=15/38) |      |            |         |          |               |
| symbol-graph-mnas-spring.gv.png     |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 10.01K      | 100% | 315.46kB/s | 0:00:00 |   | 10.01K  | 100% | 315.46kB/s | 0:00:00 | (xfr#23, | to-chk=14/38) |      |            |         |          |               |
| system-graph-mnas-spring-db.gv      |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 171         | 100% | 5.39kB/s   | 0:00:00 |   | 171     | 100% | 5.39kB/s   | 0:00:00 | (xfr#24, | to-chk=13/38) |      |            |         |          |               |
| system-graph-mnas-spring-db.gv.png  |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 13.10K      | 100% | 412.64kB/s | 0:00:00 |   | 13.10K  | 100% | 412.64kB/s | 0:00:00 | (xfr#25, | to-chk=12/38) |      |            |         |          |               |
| system-graph-mnas-spring-gtk.gv     |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.49K       | 100% | 78.53kB/s  | 0:00:00 |   | 2.49K   | 100% | 78.53kB/s  | 0:00:00 | (xfr#26, | to-chk=11/38) |      |            |         |          |               |
| system-graph-mnas-spring-gtk.gv.png |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 32.77K      |   4% | 1.01MB/s   | 0:00:00 |   | 744.50K | 100% | 2.68MB/s   | 0:00:00 | (xfr#27, | to-chk=10/38) |      |            |         |          |               |
| system-graph-mnas-spring.gv         |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.67K       | 100% | 9.83kB/s   | 0:00:00 |   | 2.67K   | 100% | 9.83kB/s   | 0:00:00 | (xfr#28, | to-chk=9/38)  |      |            |         |          |               |
| system-graph-mnas-spring.gv.png     |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 32.77K      |   4% | 120.75kB/s | 0:00:06 |   | 757.82K | 100% | 2.11MB/s   | 0:00:00 | (xfr#29, | to-chk=8/38)  |      |            |         |          |               |
| графы-mnas-spring-db.html           |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.83K       | 100% | 8.06kB/s   | 0:00:00 |   | 2.83K   | 100% | 8.06kB/s   | 0:00:00 | (xfr#30, | to-chk=7/38)  |      |            |         |          |               |
| графы-mnas-spring-gtk.html          |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 3.00K       | 100% | 8.53kB/s   | 0:00:00 |   | 3.00K   | 100% | 8.53kB/s   | 0:00:00 | (xfr#31, | to-chk=6/38)  |      |            |         |          |               |
| графы-mnas-spring.html              |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.94K       | 100% | 8.37kB/s   | 0:00:00 |   | 2.94K   | 100% | 8.37kB/s   | 0:00:00 | (xfr#32, | to-chk=5/38)  |      |            |         |          |               |
| обзор.html                          |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.69K       | 100% | 7.67kB/s   | 0:00:00 |   | 2.69K   | 100% | 7.67kB/s   | 0:00:00 | (xfr#33, | to-chk=4/38)  |      |            |         |          |               |
| static/                             |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
| static/highlight.css                |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 1.57K       | 100% | 4.47kB/s   | 0:00:00 |   | 1.57K   | 100% | 4.47kB/s   | 0:00:00 | (xfr#34, | to-chk=2/38)  |      |            |         |          |               |
| static/highlight.js                 |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 22.99K      | 100% | 65.45kB/s  | 0:00:00 |   | 22.99K  | 100% | 65.45kB/s  | 0:00:00 | (xfr#35, | to-chk=1/38)  |      |            |         |          |               |
| static/style.css                    |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 4.32K       | 100% | 12.31kB/s  | 0:00:00 |   | 4.32K   | 100% | 12.31kB/s  | 0:00:00 | (xfr#36, | to-chk=0/38)  |      |            |         |          |               |
| N118383                             |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
| sending                             | incremental | file | list       |         |   |         |      |            |         |          |               |      |            |         |          |               |
| ./                                  |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
| 0-обзор.html                        |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.73K       | 100% | 0.00kB/s   | 0:00:00 |   | 2.73K   | 100% | 0.00kB/s   | 0:00:00 | (xfr#1,  | to-chk=36/38) |      |            |         |          |               |
| 1-обзор.html                        |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.78K       | 100% | 2.65MB/s   | 0:00:00 |   | 2.78K   | 100% | 2.65MB/s   | 0:00:00 | (xfr#2,  | to-chk=35/38) |      |            |         |          |               |
| call-graph-mnas-spring-db.gv        |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 44          | 100% | 42.97kB/s  | 0:00:00 |   | 44      | 100% | 42.97kB/s  | 0:00:00 | (xfr#3,  | to-chk=34/38) |      |            |         |          |               |
| call-graph-mnas-spring-db.gv.png    |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 116         | 100% | 113.28kB/s | 0:00:00 |   | 116     | 100% | 113.28kB/s | 0:00:00 | (xfr#4,  | to-chk=33/38) |      |            |         |          |               |
| call-graph-mnas-spring-gtk.gv       |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 263         | 100% | 256.84kB/s | 0:00:00 |   | 263     | 100% | 256.84kB/s | 0:00:00 | (xfr#5,  | to-chk=32/38) |      |            |         |          |               |
| call-graph-mnas-spring-gtk.gv.png   |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 32.49K      | 100% | 30.98MB/s  | 0:00:00 |   | 32.49K  | 100% | 30.98MB/s  | 0:00:00 | (xfr#6,  | to-chk=31/38) |      |            |         |          |               |
| call-graph-mnas-spring.gv           |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 91          | 100% | 88.87kB/s  | 0:00:00 |   | 91      | 100% | 88.87kB/s  | 0:00:00 | (xfr#7,  | to-chk=30/38) |      |            |         |          |               |
| call-graph-mnas-spring.gv.png       |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 7.19K       | 100% | 6.86MB/s   | 0:00:00 |   | 7.19K   | 100% | 6.86MB/s   | 0:00:00 | (xfr#8,  | to-chk=29/38) |      |            |         |          |               |
| class-graph-mnas-spring-db.gv       |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 44          | 100% | 42.97kB/s  | 0:00:00 |   | 44      | 100% | 42.97kB/s  | 0:00:00 | (xfr#9,  | to-chk=28/38) |      |            |         |          |               |
| class-graph-mnas-spring-db.gv.png   |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 116         | 100% | 113.28kB/s | 0:00:00 |   | 116     | 100% | 113.28kB/s | 0:00:00 | (xfr#10, | to-chk=27/38) |      |            |         |          |               |
| class-graph-mnas-spring-gtk.gv      |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 59          | 100% | 57.62kB/s  | 0:00:00 |   | 59      | 100% | 57.62kB/s  | 0:00:00 | (xfr#11, | to-chk=26/38) |      |            |         |          |               |
| class-graph-mnas-spring-gtk.gv.png  |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 4.32K       | 100% | 4.12MB/s   | 0:00:00 |   | 4.32K   | 100% | 4.12MB/s   | 0:00:00 | (xfr#12, | to-chk=25/38) |      |            |         |          |               |
| class-graph-mnas-spring.gv          |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 186         | 100% | 181.64kB/s | 0:00:00 |   | 186     | 100% | 181.64kB/s | 0:00:00 | (xfr#13, | to-chk=24/38) |      |            |         |          |               |
| class-graph-mnas-spring.gv.png      |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 22.03K      | 100% | 21.01MB/s  | 0:00:00 |   | 22.03K  | 100% | 21.01MB/s  | 0:00:00 | (xfr#14, | to-chk=23/38) |      |            |         |          |               |
| mnas-spring-db.html                 |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.61K       | 100% | 2.49MB/s   | 0:00:00 |   | 2.61K   | 100% | 2.49MB/s   | 0:00:00 | (xfr#15, | to-chk=22/38) |      |            |         |          |               |
| mnas-spring-gtk.html                |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 3.08K       | 100% | 200.59kB/s | 0:00:00 |   | 3.08K   | 100% | 200.59kB/s | 0:00:00 | (xfr#16, | to-chk=21/38) |      |            |         |          |               |
| mnas-spring.html                    |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 32.77K      |  80% | 2.08MB/s   | 0:00:00 |   | 40.95K  | 100% | 2.60MB/s   | 0:00:00 | (xfr#17, | to-chk=20/38) |      |            |         |          |               |
| symbol-graph-mnas-spring-db.gv      |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 121         | 100% | 7.88kB/s   | 0:00:00 |   | 121     | 100% | 7.88kB/s   | 0:00:00 | (xfr#18, | to-chk=19/38) |      |            |         |          |               |
| symbol-graph-mnas-spring-db.gv.png  |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 25.41K      | 100% | 1.62MB/s   | 0:00:00 |   | 25.41K  | 100% | 1.62MB/s   | 0:00:00 | (xfr#19, | to-chk=18/38) |      |            |         |          |               |
| symbol-graph-mnas-spring-gtk.gv     |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 215         | 100% | 14.00kB/s  | 0:00:00 |   | 215     | 100% | 14.00kB/s  | 0:00:00 | (xfr#20, | to-chk=17/38) |      |            |         |          |               |
| symbol-graph-mnas-spring-gtk.gv.png |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 23.89K      | 100% | 1.52MB/s   | 0:00:00 |   | 23.89K  | 100% | 1.52MB/s   | 0:00:00 | (xfr#21, | to-chk=16/38) |      |            |         |          |               |
| symbol-graph-mnas-spring.gv         |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 89          | 100% | 5.79kB/s   | 0:00:00 |   | 89      | 100% | 5.79kB/s   | 0:00:00 | (xfr#22, | to-chk=15/38) |      |            |         |          |               |
| symbol-graph-mnas-spring.gv.png     |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 10.01K      | 100% | 651.95kB/s | 0:00:00 |   | 10.01K  | 100% | 651.95kB/s | 0:00:00 | (xfr#23, | to-chk=14/38) |      |            |         |          |               |
| system-graph-mnas-spring-db.gv      |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 171         | 100% | 11.13kB/s  | 0:00:00 |   | 171     | 100% | 11.13kB/s  | 0:00:00 | (xfr#24, | to-chk=13/38) |      |            |         |          |               |
| system-graph-mnas-spring-db.gv.png  |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 13.10K      | 100% | 852.80kB/s | 0:00:00 |   | 13.10K  | 100% | 852.80kB/s | 0:00:00 | (xfr#25, | to-chk=12/38) |      |            |         |          |               |
| system-graph-mnas-spring-gtk.gv     |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.49K       | 100% | 162.30kB/s | 0:00:00 |   | 2.49K   | 100% | 162.30kB/s | 0:00:00 | (xfr#26, | to-chk=11/38) |      |            |         |          |               |
| system-graph-mnas-spring-gtk.gv.png |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 32.77K      |   4% | 2.08MB/s   | 0:00:00 |   | 131.07K |  17% | 108.02kB/s | 0:00:05 |          | 744.50K       | 100% | 461.62kB/s | 0:00:01 | (xfr#27, | to-chk=10/38) |
| system-graph-mnas-spring.gv         |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.67K       | 100% | 6.70kB/s   | 0:00:00 |   | 2.67K   | 100% | 6.70kB/s   | 0:00:00 | (xfr#28, | to-chk=9/38)  |      |            |         |          |               |
| system-graph-mnas-spring.gv.png     |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 32.77K      |   4% | 82.26kB/s  | 0:00:08 |   | 757.82K | 100% | 1.16MB/s   | 0:00:00 | (xfr#29, | to-chk=8/38)  |      |            |         |          |               |
| графы-mnas-spring-db.html           |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.83K       | 100% | 4.44kB/s   | 0:00:00 |   | 2.83K   | 100% | 4.44kB/s   | 0:00:00 | (xfr#30, | to-chk=7/38)  |      |            |         |          |               |
| графы-mnas-spring-gtk.html          |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 3.00K       | 100% | 4.70kB/s   | 0:00:00 |   | 3.00K   | 100% | 4.70kB/s   | 0:00:00 | (xfr#31, | to-chk=6/38)  |      |            |         |          |               |
| графы-mnas-spring.html              |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.94K       | 100% | 4.61kB/s   | 0:00:00 |   | 2.94K   | 100% | 4.61kB/s   | 0:00:00 | (xfr#32, | to-chk=5/38)  |      |            |         |          |               |
| обзор.html                          |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 2.69K       | 100% | 4.22kB/s   | 0:00:00 |   | 2.69K   | 100% | 4.22kB/s   | 0:00:00 | (xfr#33, | to-chk=4/38)  |      |            |         |          |               |
| static/                             |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
| static/highlight.css                |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 1.57K       | 100% | 2.46kB/s   | 0:00:00 |   | 1.57K   | 100% | 2.46kB/s   | 0:00:00 | (xfr#34, | to-chk=2/38)  |      |            |         |          |               |
| static/highlight.js                 |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 22.99K      | 100% | 36.04kB/s  | 0:00:00 |   | 22.99K  | 100% | 36.04kB/s  | 0:00:00 | (xfr#35, | to-chk=1/38)  |      |            |         |          |               |
| static/style.css                    |             |      |            |         |   |         |      |            |         |          |               |      |            |         |          |               |
|                                     | 4.32K       | 100% | 6.77kB/s   | 0:00:00 |   | 4.32K   | 100% | 6.77kB/s   | 0:00:00 | (xfr#36, | to-chk=0/38)  |      |            |         |          |               |
